Q1. List any five functions of the pandas library with execution.

Amswer=  List of five function of pandas library ...

1.read_csv(): This function is used to read a CSV file and convert it into a DataFrame.

In [1]:
import pandas as pd
df = pd.read_csv("taxonomy.csv")

2.head(): This function returns the first few rows of a DataFrame.

In [2]:
df.head()

  taxonomy_id                     name parent_id     parent_name
0         101                Emergency       NaN             NaN
1      101-01        Disaster Response       101       Emergency
2      101-02           Emergency Cash       101       Emergency
3   101-02-01        Help Pay for Food    101-02  Emergency Cash
4   101-02-02  Help Pay for Healthcare    101-02  Emergency Cash

3.describe(): This function generates descriptive statistics of a DataFrame.

In [3]:
df.describe()

       taxonomy_id          name  parent_id       parent_name
count          290           290        279               279
unique         290           183         60                50
top            101  Nursing Home  106-06-07  Health Education
freq             1             4         11                15

4.groupby(): This function is used to group data by one or more columns.

In [4]:
df.groupby("parent_name")

5.merge(): This function is used to merge two DataFrames.

In [5]:
data1 = pd.DataFrame({'key1':[1,2,4,5,6],
                      'key2':[4,5,6,7,8],
                      'key3':[3,4,5,6,6]
})

data2 = pd.DataFrame({'key1':[1,2,45,6,67],
                      'key4':[56,5,6,7,8],
                      'key5':[3,56,5,6,6]
})

pd.merge(data1,data2)

   key1  key2  key3  key4  key5
0     1     4     3    56     3
1     2     5     4     5    56
2     6     8     6     7     6

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
import pandas as pd
def new_index(df):
    reindex = range(1, 2*len(df)+1, 2)
    df.index= reindex
    print(df)

In [7]:
data = {"A":[1,2,3],
        "B" : [4,5,6],
        "c" : [7,8,9]
}

In [8]:
df = pd.DataFrame(data)

In [9]:
df

   A  B  c
0  1  4  7
1  2  5  8
2  3  6  9

In [10]:
df = new_index(df)

   A  B  c
1  1  4  7
3  2  5  8
5  3  6  9

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [11]:
def test(df):
    value = df["values"].head(3)
    total_sum = value.sum()
    print(f"the sum of first three values is:{total_sum}")

In [12]:
data = {"values":[10,20,30,40,50]}

In [13]:
df = pd.DataFrame(data)
test(df)

the sum of first three values is:60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [14]:
pd.set_option("display.max_colwidth",500)
data = {"Text":["Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data."]}

In [15]:
 df = pd.DataFrame(data)

In [16]:
df['Word_Count']=df["Text"].apply(lambda x : len(x.split()))

In [17]:
df

,Text,Word_Count
0,"Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data.",40

Q5. How are DataFrame.size() and DataFrame.shape() different?

Answer -DataFrame. size:

This attribute tends to calculate the size of the DataFrame to give a value equal to the number of elements.
It is arrived at by multiplying the number of rows by the number of columns.
That is, if the possession of a DataFrame contains 3 rows and 4 columnsthe size will be 3*4 = 12

DataFrame. shape:

This attribute provides a tuple that gives the number of rows and column of the DataFrame.
The tuple contains two values: interchangeably, with ‘the number of rows’ or ‘the number of columns’.
For instance, if a DataFrame was containing 3 rows and four columns, the shape will be (3, 4).

Q6. Which function of pandas do we use to read an excel file?

Answern = In pandas , to read an Excel file  we use the "read_excel" function.
 
Example:  pandas.read_excel("xyz.xlsx")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [27]:
data = {"Email":['sudh@gmail.cpm','Div1000@gmail.com ','john.doe@gmail.com']}

In [28]:
df =pd.DataFrame(data)

In [29]:
df

                Email
0      sudh@gmail.cpm
1  Div1000@gmail.com
2  john.doe@gmail.com

In [30]:
def test(df):
    df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])
    return df

In [31]:
df1 = test(df)

In [32]:
df1

                Email  Username
0      sudh@gmail.cpm      sudh
1  Div1000@gmail.com    Div1000
2  john.doe@gmail.com  john.doe

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

In [38]:
d = {
    'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2]
}

In [39]:
df = pd.DataFrame(d)
df1 = df[(df['A'] > 5) & (df['B'] < 10)]

In [40]:
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2